#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_download_file.debian_12_cloud_image: Refreshing state... [id=local:iso/debian_12_cloud_image.img]
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=100]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.ubuntu_cloud_image will be created
  + resource "proxmox_virtual_environment_file" "ubuntu_cloud_image" {
      + content_type           = "iso"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
        }
    }

  # proxmox_virtual_environment_vm.dev_vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "dev_vm" {
        id                      = "100"
        name                    = "dev"
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ ssd               = false -> true
            # (8 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.ubuntu_vm will be created
  + resource "proxmox_virtual_environment_vm" "ubuntu_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "test-ubuntu"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + disk {
          + cache             = "none"
          + datastore_id      = "local-zfs"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = (known after apply)
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + user_account {
              + password = (sensitive value)
              + username = "user"
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with proxmox_virtual_environment_vm.dev_vm,
  on debian.tf line 106, in resource "proxmox_virtual_environment_vm" "dev_vm":
 106:       server = "192.168.${var.tag}.1"

The `server` attribute is deprecated and will be removed in a future release.
Please use the `servers` attribute instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*